README.md
```mermaid
flowchart TD
    main{"respondd_main"} --> backend("backend: unifi, omada, uisp")
    main --> client("respondd_client")
    backend -->|"REST API"| controller("controller")
    client -->|"subscribe"| multicast("multicast")
    client -->|"send per interval / on multicast request"| unicast("unicast")
    yanic{"yanic"} -->|"request metrics"| multicast
    unicast -->|"receive"| yanic
```
